Revit 2027 API
Solid.Volume Property
Returns the signed volume of this solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
public:
property double Volume {
	double get ();
}
member Volume : float with get
Return Value
Double
The real number equal to the signed volume of this solid.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this solid is not a valid Geometry object or the volume calculation failed.
Remarks
 Revit attempts to compute the volume analytically, if possible. If an analytical solution is not possible, it uses tessellated faces to calculate a reasonable approximation for the volume. The calculated volume may be slightly underestimated or overestimated if curved surfaces are present.
See Also
Reference
Solid Class
Autodesk.Revit.DB Namespace